d-emacs.org
#+TITLE: D Emacs Station
#+PROPERTY: header-args:emacs-lisp :tangle ./gdk/i-home/configs/init.el :tangle-mode (identity #o444) :mkdirp yes
#+auto_tangle: t


** Todo Stuffs (Feel free to say/add something. I will be glad!)
**** COMPLETED Finally Done.. Ooof 😄
CLOSED: [2023-03-07 Tue 14:27]
:LOGBOOK:
- CLOSING NOTE [2023-03-07 Tue 14:27]
:END:
- [X] Ditch evil-mode, go pure Emacs way!
- [X] No need modeline nor dashboard, go zen-mode with minimal distraction
    PS : Used ~olivetti-mode~ and ~(setq-default mode-line-format nil)~
- [X] Clean and minimise unnecessary package/bloat
- [X] No need doom-themes too, use one theme (Either vivendi or Catppuccin)
- [X] Setup robust and extensive use for Rss feeds
- [X] Manage emacs nix-way.
  PS : Just managing packages in nix style. Init file is good enough as such.
    Benefits are :
  + package management becomes easy with just ~nixos-rebuild~
  + You get vterm, which wont build that easily in normal emacs config under nixos
- [X] Make README.org or improve this Config.org so it is informational to all
- [X] Share some cool stuffs with others and explain it very crisp and clearly
    
**** PLAN Planning 😴 [0/5]
- [ ] add these stuffs.
  #+begin_src conf

;; Enable `diff-hl' support by default in programming buffers
(add-hook 'prog-mode-hook #'diff-hl-mode)

;; Update the highlighting without saving
(diff-hl-flydiff-mode t)

  #+end_src
- [ ] Check why tramp for root files isnt working.
  + Although i don't use it.
- [ ] Add daily quotes for ~initial-scratch-message~
- [ ] Learn more stuffs from Experienced and Master Users, like Purcell, bbsatov and others
- [ ] Learn elisp for enhancing some more stuffs


** TLDWR - Features 🌟
/too long, don't wanna read/

Some of the highlights which you might wanna copy or take from this config :

1. RSS focused, has good workflow to read. You have bionic-reading too!
2. Smoother experience and made for Pure-Gtk, Wayland use
3. Zen, Distraction free text viewing experience (No mode-line)


* Early-Init 🌅
#+begin_src emacs-lisp :noweb yes :tangle ./gdk/i-home/configs/early-init.el :tangle-mode (identity #o444) :mkdirp yes
  ;;; Personal configuration -*- lexical-binding: t -*-

    (setq package-enable-at-startup nil ; don't auto-initialize!
          ;; don't add that `custom-set-variables' block to my init.el!
          package--init-file-ensured t)
    (setq package-archives nil)


    ;; Defer garbage collection further back in the startup process
    (setq gc-cons-threshold most-positive-fixnum ; 2^61 bytes
          gc-cons-percentage 0.6)

    (add-hook 'emacs-startup-hook
              (lambda ()
                (setq gc-cons-threshold 16777216 ; 16mb
                      gc-cons-percentage 0.1)))

    (defun config:defer-gc ()
      (setq gc-cons-threshold most-positive-fixnum))
    (defun config:-do-restore-gc ()
      (setq gc-cons-threshold 16777216))
    (defun config:restore-gc ()
      (run-at-time 1 nil #'config:-do-restore-gc))

    (add-hook 'minibuffer-setup #'config:defer-gc)
    (add-hook 'minibuffer-exit #'config:restore-gc)

    (setq safe-local-variable-values
          '((org-src-preserve-indentation . t)
            (eval add-hook 'after-save-hook
                  '(lambda nil
                     (org-babel-tangle))
                  nil t)))

    (setq
     load-prefer-newer nil
     default-input-method nil
     initial-major-mode 'org-mode
     inhibit-default-init t
     inhibit-startup-screen t 			 ; Do not show the startup message.
     inhibit-startup-buffer-menu t       ; stop `list-buffers' from showing when opening multiple files.
     my-computer-has-smaller-memory-p t) ; computers with smaller memory. Not sure if it works or not!


    ;; Maximize the Emacs frame on startup
    (push '(fullscreen . maximized) default-frame-alist)

    ;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
    (push '(menu-bar-lines . 0) default-frame-alist)
    (push '(tool-bar-lines . 0) default-frame-alist)
    (push '(vertical-scroll-bars) default-frame-alist)

    ;; Suppress warnings and errors during asynchronous native compilation
    (setq native-comp-async-report-warnings-errors nil)
    (setq native-comp-deferred-compilation t)

    ;; Do not resize the frame at this early stage.
    (setq frame-inhibit-implied-resize t)

    ;; Prevent unwanted runtime builds; packages are compiled ahead-of-time when
    ;; they are installed and site files are compiled when gccemacs is installed.
    ;; (setq comp-deferred-compilation nil)
    (setq native-comp-deferred-compilation nil)

    ;; Prevent unwanted runtime builds in gccemacs (native-comp); packages are
    ;; compiled ahead-of-time when they are installed and site files are compiled
    ;; when gccemacs is installed.
    (setq comp-deferred-compilation nil)

    (provide 'early-init)
      ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
      ;;; early-init.el ends here

#+end_src  
* Start-ify 🔰
Manage Font size, Initialize Package setup and sends you startup time (Daemonize 👹 your Emacs)
#+begin_src emacs-lisp

  ;;; Personal configuration -*- lexical-binding: t -*-

  (defun display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))
  
  (add-hook 'emacs-startup-hook #'display-startup-time)
  ;; If you are thinking about adding codes for garbage-collect (gc-cons-threshold), we already did that in early-init.el

  ;; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src
* Fontify 🔤
Fonts are crucial to read.
#+begin_src emacs-lisp
  ;; You will most likely need to adjust this font size for your system!
  (defvar default-font-size 190)
  (defvar default-variable-font-size 190)
  (setf use-default-font-for-symbols nil)
  (set-fontset-font t 'unicode "Noto Emoji" nil 'append)


  (defun set-font-faces ()
    (message "Setting faces!")
    (set-face-attribute 'default nil :font "ComicCodeLigatures" :weight 'medium :height default-font-size)

    ;; Set the fixed pitch face
    (set-face-attribute 'fixed-pitch nil :font "ComicCodeLigatures" :height default-font-size)

    ;; Set the variable pitch face
    (set-face-attribute 'variable-pitch nil :font "ComicCodeLigatures" :height default-variable-font-size :weight 'medium))
#+end_src

* Cleanliness 📑
Keep folders and backuping files clean!
#+begin_src emacs-lisp
  (use-package no-littering)

  ;; no-littering doesn't set this by default so we must place
  ;; auto save files in the same path as it uses for sessions
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
  ;;  (setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
  (setq delete-old-versions -1)
  (setq version-control t)
  (setq vc-make-backup-files t)
  
  (use-package savehist
    :init
    (savehist-mode)
    :custom
    (setq savehist-additional-variables '(kill-ring search-ring regexp-search-ring)))
#+end_src

* Better Bindings ⌨️
** Custom functions
#+begin_src emacs-lisp
  (defun split-and-follow-horizontally ()
    "Basically to balance and change cursor to split window"
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))

  (defun split-and-follow-vertically ()
    "Basically to balance and change cursor to split window"
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))

  (defun d/scroll-down ()
    "Trust me, make scrolling alot smoother. +1 Makes you fall in love with Emacs again!"
    (interactive)
    (pixel-scroll-precision-scroll-down 40))

  (defun d/scroll-up ()
    "Trust me, adds a wonderfull smooth scroll. You can do this by trackpad too (laptop)"
    (interactive)
    (pixel-scroll-precision-scroll-up 40))
  (defun d/refresh-buffer ()
    "Revert buffer without confirmation."
    (interactive)
    (revert-buffer :ignore-auto :noconfirm))

  (defun window-focus-mode ()
    "Make the window focused, it can toggled in and out"
    (interactive)
    (if (= 1 (length (window-list)))
        (jump-to-register '_)
      (progn
        (set-register '_ (list (current-window-configuration)))
        (delete-other-windows))))

    #+end_src
** Respected binds
#+begin_src emacs-lisp

  (global-set-key (kbd "M-v") #'d/scroll-up)
  (global-set-key (kbd "C-v") #'d/scroll-down)
  (global-set-key (kbd "C-<f5>") #'d/refresh-buffer)

  (global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)
  (global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
  (global-set-key [C-tab] 'other-window)
  (global-set-key (kbd "C-c c") 'calendar)

  (global-set-key (kbd "C-c f") 'window-focus-mode)
  ;; (global-set-key (kbd "C-M-r") 'undo-redo)
  (global-set-key (kbd "C-M-r") 'undo-tree-redo) ;; If want to use undo-tree mode
  (global-set-key (kbd "M-j") 'avy-goto-char-timer) ;;Save ton to pain/strain
  (global-set-key (kbd "M-K") 'avy-kill-region) ;; Practise these two avy binding, it will be of great help
  (global-set-key (kbd "C-x C-k") 'd/kill-buffer) ;; My func to clear cache along killing buffer
  (global-set-key (kbd "C-x k") 'd/kill-buffer)
  (global-set-key (kbd "M-%") 'query-replace-regexp) ;; Hail regexp searching!

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (defalias 'yes-or-no-p 'y-or-n-p) ;; Make confirmation messages easy and not a pain.

#+end_src
